In [15]:
import pandas as pd
import numpy as np

In [17]:
col1 = [1,2,3]
col2 = [4,5]
col3 = [6,7,8,9]

In [19]:
max_len = max(len(col1),len(col2),len(col3))
col1 += [np.nan] * (max_len - len(col1))
col2 += [np.nan] * (max_len - len(col2)) 
col3 += [np.nan] * (max_len - len(col3))

In [23]:
df = pd.DataFrame ({'Column1':col1,'Column2':col2,'Column3':col3})
df

   Column1  Column2  Column3
0      1.0      4.0        6
1      2.0      5.0        7
2      3.0      NaN        8
3      NaN      NaN        9

In [25]:
names = ['Jmaes','Joseph','Michelle','Joram','Joel','Mark','Rose']
age = [34,45,60,67,45]
salary = [34000,4500,67000,3000]

In [29]:
max_len = max (len(names),len(age),len(salary))
names += [np.nan] * (max_len - len(names))
age += [np.nan] * (max_len - len(age))
salary += [np.nan] * (max_len - len(salary))

In [40]:
df = pd.DataFrame ({'Emplyees': names,
                    'Ages': age,
                    'Salary': salary
                   })
df

   Emplyees  Ages   Salary
0     Jmaes  34.0  34000.0
1    Joseph  45.0   4500.0
2  Michelle  60.0  67000.0
3     Joram  67.0   3000.0
4      Joel  45.0      NaN
5      Mark   NaN      NaN
6      Rose   NaN      NaN